In [52]:
import requests
import os
from dotenv import load_dotenv; load_dotenv()
from bs4 import BeautifulSoup
from mysql.connector import connect

In [2]:
url = 'https://learnsql.com/blog/partition-by-with-over-sql/'
res = requests.get(url)
res.status_code

200

In [21]:
soup = BeautifulSoup(res.text, 'html.parser')
tables = soup.find_all('table')

### PARTITION BY

In [31]:
# attract table car_list_prices
car_list_prices_table = tables[0]

# retrieve headers
headers = [cell.text for cell in car_list_prices_table.find_all('th')]

# retrieve rows
rows = car_list_prices_table.find_all('tr')[1:]
data = [
    (
        row.find_all('td')[0].text, # car_make
        row.find_all('td')[1].text, # car_model
        row.find_all('td')[2].text, # car_type
        int(row.find_all('td')[3].text) # car_price
    )
    for row in rows
]

In [67]:
# create table script
CREATE_TABLE = """CREATE TABLE car_list_prices (
    car_make VARCHAR(10)
    ,car_model VARCHAR(10)
    ,car_type VARCHAR(15)
    ,car_price INT
)
"""

In [56]:
config = {
    'host': os.getenv('HOST')
    ,'user': os.getenv('USER_')
    ,'password': os.getenv('PASSWORD')
    ,'database': 'learnsql'
}

In [96]:
with connect(**config) as conn:
    if not conn.is_connected():
        print('unable to connect')

    with conn.cursor() as cur:
        try:
            print('...creating table')
            cur.execute(CREATE_TABLE)
        except Exception as e:
            print('\nError:', e)

        cur.executemany(
            "INSERT INTO car_list_prices VALUES (%s, %s, %s, %s)"
            ,data
        )
        conn.commit()

        print()

        cur.execute('select * from car_list_prices limit 3')
        result = cur.fetchall()
        print('printing result...')
        for x in result: print('\t', x)

    print('\n...connection closed')

...creating table

Error: 1050 (42S01): Table 'car_list_prices' already exists

printing result...
	 ('Ford', 'Mondeo', 'premium', 18200)
	 ('Renault', 'Fuego', 'sport', 16500)
	 ('Citroen', 'Cactus', 'premium', 19000)

...connection closed

In [88]:
%load_ext sql

In [93]:
conn_string = f"mysql+pymysql://{os.getenv('USER_')}:{os.getenv('PASSWORD')}@{os.getenv('HOST')}/learnsql"
%sql $conn_string

In [97]:
%%sql
select * from car_list_prices;

 * mysql+pymysql://tina:***@localhost/learnsql
7 rows affected.

[('Ford', 'Mondeo', 'premium', 18200),
 ('Renault', 'Fuego', 'sport', 16500),
 ('Citroen', 'Cactus', 'premium', 19000),
 ('Ford', 'Falcon', 'low cost', 8990),
 ('Ford', 'Galaxy', 'standard', 12400),
 ('Renault', 'Megane', 'standard', 14300),
 ('Citroen', 'Picasso', 'premium', 23400)]

obtain the make, the model, the price, the average price

In [104]:
%%sql
select
    car_make
    ,car_model
    ,car_type
    ,car_price
    ,round(avg(car_price) over (partition by car_type), 2) as average_price_per_type
    ,round(avg(car_price) over (partition by car_make), 2) as average_price_per_make
from car_list_prices;

 * mysql+pymysql://tina:***@localhost/learnsql
7 rows affected.

[('Citroen', 'Cactus', 'premium', 19000, Decimal('20200.00'), Decimal('21200.00')),
 ('Citroen', 'Picasso', 'premium', 23400, Decimal('20200.00'), Decimal('21200.00')),
 ('Ford', 'Falcon', 'low cost', 8990, Decimal('8990.00'), Decimal('13196.67')),
 ('Ford', 'Mondeo', 'premium', 18200, Decimal('20200.00'), Decimal('13196.67')),
 ('Ford', 'Galaxy', 'standard', 12400, Decimal('13350.00'), Decimal('13196.67')),
 ('Renault', 'Fuego', 'sport', 16500, Decimal('16500.00'), Decimal('15400.00')),
 ('Renault', 'Megane', 'standard', 14300, Decimal('13350.00'), Decimal('15400.00'))]